package C01Basic;

// 클래스의 명명규칙
// 1) 반드시 public class명과 파일명이 일치해야한다.
// public -> 접근 제어자로 프로젝트 전역에서 접근 가능
// 하나의 파일에 public class는 only one
// 2) 일반적으로 대문자 알파벳으로 시작

public class C00HelloWorld {
/* ******************************************************************
*   (메서드 & 변수)명은 일반적으로 소문자 알파벳으로 시작한다                *
*   어디에서든 접근가능하고(public), 리턴값이 없는 메서드(void)           *
*   main메서드는 프로그램 실행시 가장 먼저 실행되는 메서드                *
*****************************************************************
 */
    public static void main(String[] args) {
//      sout 단축어를 통해 실행
//      java의 모든 명령문은 세미콜론을 통해 끝맺음
        System.out.println("Hello world.");
    }
}
